//Создать класс MyArea, в нем объявить константу PI = 3.14 и статический метод areaOfCircle,
//который должен принимать радиус и используя PI посчитать площадь круга. Создать класс Main, где запустить
//данный метод.

package com.cbs.java_essential.dikalo.homework.lesson2.task4;

public class Main {
    public static void main(String[] args) {
        System.out.println(MyArea.areaOfCircle(5));
    }
}
